In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
s = pd.Series(['Sam', np.nan, 'Tim', 'Kim'])

In [5]:
s

0    Sam
1    NaN
2    Tim
3    Kim
dtype: object

In [6]:
#Check for missing values

In [7]:
s.isnull()

0    False
1     True
2    False
3    False
dtype: bool

In [8]:
s.notnull()

0     True
1    False
2     True
3     True
dtype: bool

In [9]:
s[3] = None

In [10]:
s

0     Sam
1     NaN
2     Tim
3    None
dtype: object

In [53]:
s.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [54]:
s.dropna()

0    Sam
2    Tim
dtype: object

In [67]:
from numpy import nan as NA

In [68]:
df = pd.DataFrame([[1,2,3], [4, NA, 5], [NA, NA, NA]])

In [69]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [70]:
df.dropna()  # removes a full row if it contains at least one NaN

     0    1    2
0  1.0  2.0  3.0

In [71]:
df[1] = NA    # takes column by default
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [72]:
df.dropna(axis = 1, how = 'all')

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [73]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [74]:
df.dropna(thresh = 3)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [76]:
df.fillna(0)

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [77]:
df.fillna({0:15, 1:25, 2:35})

      0     1     2
0   1.0  25.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [78]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [79]:
df.fillna(0, inplace = True)

In [80]:
df

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [85]:
df = pd.DataFrame([[1,2,3], [4, NA, 5], [NA, NA, NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [83]:
df.fillna(method = 'ffill')

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [87]:
df.fillna(method = 'ffill', limit = 1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0

In [88]:
data = pd.Series([1,0, NA, 5])

In [89]:
data

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [90]:
data.fillna(data.mean())

0    1.0
1    0.0
2    2.0
3    5.0
dtype: float64

In [91]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [94]:
df.fillna(df.mean())

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  2.5  2.0  4.0

In [95]:
import numpy as np
import pandas as pd

In [103]:
df = pd.DataFrame([
    [2.4,np.nan],[6.3,-5.4],[np.nan, np.nan],[0.75, -1.3]
], index = ['a', 'b','c','d'],columns = ['one', 
                                        'two'])

In [104]:
df

    one  two
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3

In [105]:
df.sum()

one    9.45
two   -6.70
dtype: float64

In [113]:
df.sum(axis = 1, skipna = False)

a     NaN
b    0.90
c     NaN
d   -0.55
dtype: float64

In [114]:
df.mean(axis = 1)

a    2.400
b    0.450
c      NaN
d   -0.275
dtype: float64

In [115]:
df.mean(axis =1, skipna = False)

a      NaN
b    0.450
c      NaN
d   -0.275
dtype: float64

In [116]:
df.idxmax()

one    b
two    d
dtype: object

In [118]:
df.idxmin()

one    d
two    b
dtype: object

In [120]:
df.cumsum()

    one  two
a  2.40  NaN
b  8.70 -5.4
c   NaN  NaN
d  9.45 -6.7

In [122]:
df.describe()

         one       two
count  3.000  2.000000
mean   3.150 -3.350000
std    2.850  2.899138
min    0.750 -5.400000
25%    1.575 -4.375000
50%    2.400 -3.350000
75%    4.350 -2.325000
max    6.300 -1.300000

In [129]:
iris = pd.read_csv('iris.data', header = None)

In [130]:
iris.head(6)

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
5  5.4  3.9  1.7  0.4  Iris-setosa

In [131]:
iris.columns = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'class']

In [132]:
iris.head(5)

   sepal_length  sepal_width  petal_length  petal_width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [133]:
iris["sepal_length"].corr(iris["sepal_width"])

-0.10936924995064935

In [134]:
iris.corr()

C:\Users\sagar\AppData\Local\Temp\ipykernel_13036\2141086772.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  iris.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.109369      0.871754     0.817954
sepal_width      -0.109369     1.000000     -0.420516    -0.356544
petal_length      0.871754    -0.420516      1.000000     0.962757
petal_width       0.817954    -0.356544      0.962757     1.000000

In [135]:
iris.var()

C:\Users\sagar\AppData\Local\Temp\ipykernel_13036\2384711547.py:1: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  iris.var()

sepal_length    0.685694
sepal_width     0.188004
petal_length    3.113179
petal_width     0.582414
dtype: float64

In [140]:
iris.cov()

C:\Users\sagar\AppData\Local\Temp\ipykernel_13036\2160233148.py:1: FutureWarning: The default value of numeric_only in DataFrame.cov is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  iris.cov()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      0.685694    -0.039268      1.273682     0.516904
sepal_width      -0.039268     0.188004     -0.321713    -0.117981
petal_length      1.273682    -0.321713      3.113179     1.296387
petal_width       0.516904    -0.117981      1.296387     0.582414

In [142]:
iris.corrwith(iris['petal_length'])

C:\Users\sagar\AppData\Local\Temp\ipykernel_13036\2396730339.py:1: FutureWarning: The default value of numeric_only in DataFrame.corrwith is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  iris.corrwith(iris['petal_length'])

sepal_length    0.871754
sepal_width    -0.420516
petal_length    1.000000
petal_width     0.962757
dtype: float64

In [143]:
s = pd.Series(['b','b','b','b','c','c','a', 'a', 'a'])

In [144]:
s

0    b
1    b
2    b
3    b
4    c
5    c
6    a
7    a
8    a
dtype: object

In [145]:
s.unique()

array(['b', 'c', 'a'], dtype=object)

In [147]:
s.value_counts()

b    4
a    3
c    2
dtype: int64

In [148]:
x = s.isin(['b', 'c'])

In [149]:
x

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7    False
8    False
dtype: bool

In [150]:
s[x]

0    b
1    b
2    b
3    b
4    c
5    c
dtype: object

In [151]:
# Table Extract as assignment